==================================================================================================================================
Layer (type:depth-idx)                                  Input Shape               Output Shape              Param #
==================================================================================================================================
CLIPModel                                               [16, 3, 224, 224]         [16, 512]                 --
├─CLIP: 1-1                                             --                        --                        63,428,097
│    └─VisionTransformer: 2-1                           [16, 3, 224, 224]         [16, 512]                 432,384
│    │    └─Conv2d: 3-1                                 [16, 3, 224, 224]         [16, 768, 7, 7]           2,359,296
│    │    └─LayerNorm: 3-2                              [16, 50, 768]             [16, 50, 768]             1,536
│    │    └─Transformer: 3-3                            [50, 16, 768]             [50, 16, 768]             85,054,464
│    │    └─LayerNorm: 3-4                              [16, 768]                 [16, 768]                 1,536
==================================================================================================================================
Total params: 151,277,313
Trainable params: 151,277,313
Non-trainable params: 0
Total mult-adds (G): 4.69
==================================================================================================================================
Input size (MB): 9.63
Forward/backward pass size (MB): 211.35
Params size (MB): 118.22
Estimated Total Size (MB): 339.20
==================================================================================================================================