===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #
===================================================================================================================
HarmonicCNN                              [16, 80000]               [16, 50]                  --
├─HarmonicSTFT: 1-1                      [16, 80000]               [16, 6, 128, 313]         1
├─BatchNorm2d: 1-2                       [16, 6, 128, 313]         [16, 6, 128, 313]         12
├─Conv_2d: 1-3                           [16, 6, 128, 313]         [16, 128, 64, 156]        7,296
├─Res_2d_mp: 1-4                         [16, 128, 64, 156]        [16, 128, 32, 78]         295,680
├─Res_2d_mp: 1-5                         [16, 128, 32, 78]         [16, 128, 16, 39]         295,680
├─Res_2d_mp: 1-6                         [16, 128, 16, 39]         [16, 128, 8, 19]          295,680
├─Conv_2d: 1-7                           [16, 128, 8, 19]          [16, 256, 4, 9]           295,680
├─Res_2d_mp: 1-8                         [16, 256, 4, 9]           [16, 256, 2, 3]           1,181,184
├─Res_2d_mp: 1-9                         [16, 256, 2, 3]           [16, 256, 1, 1]           1,181,184
├─Linear: 1-10                           [16, 256]                 [16, 256]                 65,792
├─BatchNorm1d: 1-11                      [16, 256]                 [16, 256]                 512
├─ReLU: 1-12                             [16, 256]                 [16, 256]                 --
├─Dropout: 1-13                          [16, 256]                 [16, 256]                 --
├─Linear: 1-14                           [16, 256]                 [16, 50]                  12,850
===================================================================================================================
Total params: 3,631,551
Trainable params: 3,631,551
Non-trainable params: 0
Total mult-adds (G): 67.91
===================================================================================================================
Input size (MB): 5.12
Forward/backward pass size (MB): 2217.91
Params size (MB): 14.53
Estimated Total Size (MB): 2237.55
===================================================================================================================