===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #
===================================================================================================================
HarmonicCNNEmbeddings                    [16, 80000]               [16, 256]                 --
├─Sequential: 1-1                        [16, 80000]               [16, 256, 1, 1]           --
│    └─HarmonicSTFT: 2-1                 [16, 80000]               [16, 6, 128, 313]         1
│    └─BatchNorm2d: 2-2                  [16, 6, 128, 313]         [16, 6, 128, 313]         12
│    └─Conv_2d: 2-3                      [16, 6, 128, 313]         [16, 128, 64, 156]        7,296
│    └─Res_2d_mp: 2-4                    [16, 128, 64, 156]        [16, 128, 32, 78]         295,680
│    └─Res_2d_mp: 2-5                    [16, 128, 32, 78]         [16, 128, 16, 39]         295,680
│    └─Res_2d_mp: 2-6                    [16, 128, 16, 39]         [16, 128, 8, 19]          295,680
│    └─Conv_2d: 2-7                      [16, 128, 8, 19]          [16, 256, 4, 9]           295,680
│    └─Res_2d_mp: 2-8                    [16, 256, 4, 9]           [16, 256, 2, 3]           1,181,184
│    └─Res_2d_mp: 2-9                    [16, 256, 2, 3]           [16, 256, 1, 1]           1,181,184
===================================================================================================================
Total params: 3,552,397
Trainable params: 3,552,397
Non-trainable params: 0
Total mult-adds (G): 67.91
===================================================================================================================
Input size (MB): 5.12
Forward/backward pass size (MB): 2217.84
Params size (MB): 14.21
Estimated Total Size (MB): 2237.17
===================================================================================================================