===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #
===================================================================================================================
SampleCNNEmbeddings                      [16, 98415]               [16, 512]                 --
├─Sequential: 1-1                        [16, 1, 98415]            [16, 512, 1]              --
│    └─Sequential: 2-1                   [16, 1, 98415]            [16, 128, 19683]          1,024
│    └─Sequential: 2-2                   [16, 128, 19683]          [16, 128, 6561]           49,536
│    └─Sequential: 2-3                   [16, 128, 6561]           [16, 128, 2187]           49,536
│    └─Sequential: 2-4                   [16, 128, 2187]           [16, 256, 729]            99,072
│    └─Sequential: 2-5                   [16, 256, 729]            [16, 256, 243]            197,376
│    └─Sequential: 2-6                   [16, 256, 243]            [16, 256, 81]             197,376
│    └─Sequential: 2-7                   [16, 256, 81]             [16, 256, 27]             197,376
│    └─Sequential: 2-8                   [16, 256, 27]             [16, 256, 9]              197,376
│    └─Sequential: 2-9                   [16, 256, 9]              [16, 512, 3]              394,752
│    └─Sequential: 2-10                  [16, 512, 3]              [16, 512, 1]              787,968
│    └─Sequential: 2-11                  [16, 512, 1]              [16, 512, 1]              263,680
===================================================================================================================
Total params: 2,435,072
Trainable params: 2,435,072
Non-trainable params: 0
Total mult-adds (G): 27.88
===================================================================================================================
Input size (MB): 6.30
Forward/backward pass size (MB): 1720.75
Params size (MB): 9.74
Estimated Total Size (MB): 1736.78
===================================================================================================================