===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #
===================================================================================================================
ShortChunkCNN_Res                        [16, 59049]               [16, 50]                  --
├─MelSpectrogram: 1-1                    [16, 59049]               [16, 128, 231]            --
├─AmplitudeToDB: 1-2                     [16, 128, 231]            [16, 128, 231]            --
├─BatchNorm2d: 1-3                       [16, 1, 128, 231]         [16, 1, 128, 231]         2
├─Res_2d: 1-4                            [16, 1, 128, 231]         [16, 128, 64, 116]        150,912
├─Res_2d: 1-5                            [16, 128, 64, 116]        [16, 128, 32, 58]         443,520
├─Res_2d: 1-6                            [16, 128, 32, 58]         [16, 256, 16, 29]         1,181,952
├─Res_2d: 1-7                            [16, 256, 16, 29]         [16, 256, 8, 15]          1,771,776
├─Res_2d: 1-8                            [16, 256, 8, 15]          [16, 256, 4, 8]           1,771,776
├─Res_2d: 1-9                            [16, 256, 4, 8]           [16, 256, 2, 4]           1,771,776
├─Res_2d: 1-10                           [16, 256, 2, 4]           [16, 512, 1, 2]           4,723,200
├─Linear: 1-11                           [16, 512]                 [16, 512]                 262,656
├─BatchNorm1d: 1-12                      [16, 512]                 [16, 512]                 1,024
├─ReLU: 1-13                             [16, 512]                 [16, 512]                 --
├─Dropout: 1-14                          [16, 512]                 [16, 512]                 --
├─Linear: 1-15                           [16, 512]                 [16, 50]                  25,650
===================================================================================================================
Total params: 12,104,244
Trainable params: 12,104,244
Non-trainable params: 0
Total mult-adds (G): 44.43
===================================================================================================================
Input size (MB): 3.78
Forward/backward pass size (MB): 1039.65
Params size (MB): 48.42
Estimated Total Size (MB): 1091.85
===================================================================================================================