===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #
===================================================================================================================
ShortChunkCNNEmbeddings                  [16, 59049]               [16, 512]                 --
├─Sequential: 1-1                        [16, 59049]               [16, 128, 231]            --
│    └─MelSpectrogram: 2-1               [16, 59049]               [16, 128, 231]            --
│    └─AmplitudeToDB: 2-2                [16, 128, 231]            [16, 128, 231]            --
├─BatchNorm2d: 1-2                       [16, 1, 128, 231]         [16, 1, 128, 231]         2
├─Sequential: 1-3                        [16, 1, 128, 231]         [16, 512, 1, 2]           --
│    └─Res_2d: 2-3                       [16, 1, 128, 231]         [16, 128, 64, 116]        150,912
│    └─Res_2d: 2-4                       [16, 128, 64, 116]        [16, 128, 32, 58]         443,520
│    └─Res_2d: 2-5                       [16, 128, 32, 58]         [16, 256, 16, 29]         1,181,952
│    └─Res_2d: 2-6                       [16, 256, 16, 29]         [16, 256, 8, 15]          1,771,776
│    └─Res_2d: 2-7                       [16, 256, 8, 15]          [16, 256, 4, 8]           1,771,776
│    └─Res_2d: 2-8                       [16, 256, 4, 8]           [16, 256, 2, 4]           1,771,776
│    └─Res_2d: 2-9                       [16, 256, 2, 4]           [16, 512, 1, 2]           4,723,200
├─MaxPool2d: 1-4                         [16, 512, 1, 2]           [16, 512, 1, 1]           --
===================================================================================================================
Total params: 11,814,914
Trainable params: 11,814,914
Non-trainable params: 0
Total mult-adds (G): 44.43
===================================================================================================================
Input size (MB): 3.78
Forward/backward pass size (MB): 1039.52
Params size (MB): 47.26
Estimated Total Size (MB): 1090.55
===================================================================================================================